

print(16**8-1,8**10)
print((16**8-1-8**10)//10)

'''
313)	(Е. Джобс) Сколько существует целых положительных чисел, для которых одновременно выполняются следующие условия:
– в шестнадцатеричной записи содержится не более 8 цифр;
– в восьмеричной записи не менее 11 цифр;
– последняя цифра в десятичной системе счисления – 5?

'''