
def sch(n):
    summ=0
    for i in str(n):
        if int(i)%2==0:
            summ+=1
    return summ
def snch(n):
    summ=0
    for i in str(n):
        if int(i)%2==1:
            summ+=1
    return summ


k=0
maxa=0
a=[int(x) for x in open('17-304.txt')]
am=max(a)
for i in range(len(a)-1):
    if sch(a[i])==snch(a[i]) and sch(a[i+1])==snch(a[i+1]):
        if (a[i]+a[i+1])>am:
            k+=1
            maxa=max(maxa,a[i]+a[i+1])

print(k,maxa)




'''
308)	(М. Шагитов) В файле 17-304.txt содержится последовательность целых чисел. 
Элементы последовательности могут принимать значения от 0 до 10000 включительно. 
Найдите все пары элементов последовательности, в которых в обоих числах пары равное количество чётных и нечётных цифр, 
а сумма чисел пары больше максимального элемента последовательности. 
В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. 
В данной задаче под парой подразумевается два идущих подряд элемента последовательности.
'''