from turtle import*
k=5
screensize(10000,10000)
speed(1000)

for i in range(1):
    p=pos()
    goto(p+(200*k,100*k))
    p = pos()
    goto(p + ((-50) * k, (-150) * k))
    p = pos()
    goto(p + ((-150) * k, 50 * k))
up()

for x in range(-10,200):
    for y in range(-60,100):
        goto(x*k,y*k)
        dot(4,'red')
exitonclick()
'''
Повтори 10 раз
  Сместиться на (200, 100) 
  Сместиться на (-50, -150)  
  Сместиться на (-150, 50)
конец 
Определите, сколько точек с целочисленными координатами принадлежат траектории движения Чертёжника.
'''