
def f(x,a1,a2):
    p=1023<=x<=2148
    q=1362<=x<=3898
    r=1813<=x<=2566
    a=a1<=x<=a2
    return (not((q)<=(p or r)))<=((not(a))<=(not(q)))

p=[x+d for x in [1023, 1362,1813, 2148,2566,3898] for d in [-0.1,0,0.1]]
am=10**10
for a1 in p:
    for a2 in p:
        if all(f(x,a1,a2) for x in p):
            am=min(am,round(a2)-round(a1))

print(am)


'''
537) На числовой прямой даны три отрезка:
 P = [1023; 2148], Q = [1362; 3898] и R = [1813; 2566]. 
 Укажите наименьшую возможную длину такого отрезка A, что формула
(¬((x ∈ Q) → ((x ∈ P) ∨ (x ∈ R)))) → (¬(x ∈ A) → ¬(x ∈ Q))
тождественно истинна, то есть принимает значение 1 при любом значении переменной х?
'''