def f(x,a1,a2):
    p=57892<=x<=478683
    q=123456<=x<=760123
    r=592916<=x<=977654
    a=a1<=x<=a2
    return q<=((not(p))<=(((not(r))and (not(a)))<=(not(q))))

p=[x+d for x in [57892,123456,478683,592916,760123,977654] for d in [-0.1,0,0.1]]
am=10**100
for a1 in p:
    for a2 in p:
        if all(f(x,a1,a2) for x in p):
            am=min(am,round(a2)-round(a1))
print(am)


'''
    571) На числовой прямой даны три отрезка: 
    P = [57892; 478683], Q = [123456; 760123], R = [592916; 977654]. 
    Укажите наименьшую возможную длину такого отрезка A, что формула
(x ∈ Q) → (¬(x ∈ P) → ((¬(x ∈ R) ∧ ¬(x ∈ A)) → ¬(x ∈ Q)))
тождественно истинна, то есть принимает значение 1 при любом значении переменной х?
'''